#@ # 
#@ # Running icc2_shell Version O-2018.06-SP1 for linux64 -- Jul 17, 2018
#@ # Date:   Tue Sep  9 18:34:01 2025
#@ # Run by: ICer@IC_EDA
#@ 

set_host_options -max_cores 6
set design RV32I
sh rm /home/ICer/ITI/RV32I_pnr/PNR/design_library/${design}.dlib/${design}_cts/design.ndm.lock
set GDS_MAP_FILE "/home/ICer/Downloads/Lib/Technology_Kit/milkyway/saed90nm.gdsout.map"
set design_lib_path /home/ICer/ITI/RV32I_pnr/PNR/design_library
open_block $design_lib_path/${design}.dlib:${design}_cts.design
copy_block -from_block ${design}.dlib:${design}_cts.design -to_block ${design}_route
current_block ${design}_route.design
start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
link_block
all_high_transitive_fanout -nets -through_buf_inv
# --All layers below M1 and above M9 are set as ignored layers.
set_ignored_layer -max M9 -min M1
route_global -effort_level high
check_routes
# ================================================ #
# ================= Track Assign ================= #
# ================================================ #
route_track
check_routes
# ================================================ #
# =============== Detailed Route ================= #
# ================================================ #
route_detail
check_routes
route_detail -incremental true
check_routes
route_detail -incremental true
check_routes
# ================================================ #
# =============== Optimized Route ================ #
# ================================================ #
route_opt
check_routes
report_timing -delay_type min -max_paths 3
report_timing -delay_type max -max_paths 3
route_global -effort_level high
check_routes
# ================================================ #
# ================= Track Assign ================= #
# ================================================ #
route_track
check_routes
# ================================================ #
# =============== Detailed Route ================= #
# ================================================ #
route_detail
check_routes
route_detail -incremental true
check_routes
# ================================================ #
# =============== Optimized Route ================ #
# ================================================ #
route_opt
check_routes
report_timing -delay_type min -max_paths 3
report_timing -delay_type max -max_paths 3
route_global -effort_level high
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-77}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {cell_array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-77}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
check_routes
# ================================================ #
# ================= Track Assign ================= #
# ================================================ #
route_track
check_routes
# ================================================ #
# =============== Detailed Route ================= #
# ================================================ #
route_detail
check_routes
route_detail -incremental true
check_routes
# ================================================ #
# =============== Optimized Route ================ #
# ================================================ #
route_opt
check_routes
report_timing -delay_type min -max_paths 3
report_timing -delay_type max -max_paths 3
route_global -effort_level high
check_routes
# ================================================ #
# ================= Track Assign ================= #
# ================================================ #
route_track
check_routes
# ================================================ #
# =============== Detailed Route ================= #
# ================================================ #
route_detail
check_routes
route_detail -incremental true
check_routes
# ================================================ #
# =============== Optimized Route ================ #
# ================================================ #
route_opt
check_routes
report_timing -delay_type min -max_paths 3
report_timing -delay_type max -max_paths 3
route_global -effort_level high
check_routes
# ================================================ #
# ================= Track Assign ================= #
# ================================================ #
route_track
check_routes
# ================================================ #
# =============== Detailed Route ================= #
# ================================================ #
route_detail
check_routes
route_detail -incremental true
check_routes
# ================================================ #
# =============== Optimized Route ================ #
# ================================================ #
route_opt
check_routes
report_timing -delay_type min -max_paths 3
report_timing -delay_type max -max_paths 3
route_global -effort_level high
check_routes
# ================================================ #
# ================= Track Assign ================= #
# ================================================ #
route_track
check_routes
# ================================================ #
# =============== Detailed Route ================= #
# ================================================ #
route_detail
check_routes
route_detail -incremental true
check_routes
# ================================================ #
# =============== Optimized Route ================ #
# ================================================ #
route_opt
check_routes
report_timing -delay_type min -max_paths 3
report_timing -delay_type max -max_paths 3
route_global -effort_level high
check_routes
# ================================================ #
# ================= Track Assign ================= #
# ================================================ #
route_track
check_routes
# ================================================ #
# =============== Detailed Route ================= #
# ================================================ #
route_detail
check_routes
route_detail -incremental true
check_routes
# ================================================ #
# =============== Optimized Route ================ #
# ================================================ #
route_opt
check_routes
report_timing -delay_type min -max_paths 3
report_timing -delay_type max -max_paths 3
exit
