
icc2_shell> set design SYSTEM_TOP
SYSTEM_TOP
icc2_shell> # remove the .lock file
icc2_shell> sh rm /home/ICer/Projects/Digital_System(RTL-to-GDSII)/pnr/design_library/${design}.dlib/${design}_pp/design.ndm.lock
Error: sh: -c: line 0: syntax error near unexpected token `('
sh: -c: line 0: `rm /home/ICer/Projects/Digital_System(RTL-to-GDSII)/pnr/design_library/SYSTEM_TOP.dlib/SYSTEM_TOP_pp/design.ndm.lock'
        Use error_info for more info. (CMD-013)
icc2_shell> 
icc2_shell> 
icc2_shell> set design_lib_path /home/ICer/Projects/Digital_System(RTL-to-GDSII)/pnr/design_library
/home/ICer/Projects/Digital_System(RTL-to-GDSII)/pnr/design_library
icc2_shell> open_block $design_lib_path/${design}.dlib:${design}_pp.design
Information: User units loaded from library 'saed90nm_m' (LNK-040)
Opening block 'SYSTEM_TOP.dlib:SYSTEM_TOP_pp.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
{SYSTEM_TOP.dlib:SYSTEM_TOP_pp.design}
icc2_shell> start_gui
Begin building search trees for block SYSTEM_TOP.dlib:SYSTEM_TOP_pp.design
Done building search trees for block SYSTEM_TOP.dlib:SYSTEM_TOP_pp.design (time 0s)
icc2_shell> link_block
Using libraries: SYSTEM_TOP.dlib saed90nm_m saed90nm_max_cg
Warning: In library SYSTEM_TOP.dlib, no block views exist for block SYSTEM_TOP. (LNK-064)
Visiting block SYSTEM_TOP.dlib:SYSTEM_TOP_pp.design
Design 'SYSTEM_TOP' was successfully linked.
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start RulerTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -drag {{17.325 258.830} {17.450 257.520}} -scale 0.0623
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {17.450 257.520} -scale 0.0623
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -abort
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -start RulerTool
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {10.010 253.920} -scale 0.0376
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -add_point {8.845 253.960} -scale 0.0376
icc2_shell> gui_mouse_tool -window [gui_get_current_window -types Layout -mru] -reset
icc2_shell> gui_remove_all_rulers -window [gui_get_current_window -types Layout -mru];  gui_remove_all_rulers -window global
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal7} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal9} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal8} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
1
icc2_shell> exit
Maximum memory usage for this session: 219.13 MB
CPU usage for this session:     47 seconds (  0.01 hours)
Elapsed time for this session:   2928 seconds (  0.81 hours)
Thank you for using IC Compiler II.

